Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དགྲ་བཅོམ་བྱེ་བ་བརྒྱ་ཕྲག་གཅིག་ཚང་སྟེ། །གཉིས་པར་དགུ་བཅུ་རྩ་དྲུག་གསུམ་པར་ཡང་། །བརྒྱད་ཅུ་ཡོད་དེ་དེ་ཚེ་སྐུ་ཚེའི་ཚད། །
en: One billion worthy ones will gather. In the second congregation will be nine hundred sixty million And in the third congregation, eight hundred million.

source: འཇིག་རྟེན་དག་ན་དེ་ཚེ་ལོ་སྟོང་ཡིན། །
en: “His lifespan in the world will be one thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one who has reached exhaustion Will remain for ninety-six thousand years.

source: མཆོད་རྟེན་ཁྱད་པར་འཕགས་པ་དུང་ཕྱུར་ལྔ། །ནོར་བུ་རིན་ཆེན་མཆོག་མ་དག་གིས་སྤྲས། །
en: There will be five hundred million extraordinary stūpas, “Studded with various types of precious jewels.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཞལ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ཚོགས་ཞེས་བྱ། །
en: The thus-gone Śaśivaktra will be born In a place called Merit Accumulated.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་གསུམ་ཡོད་ཡབ་ནི་རྒྱ་མཚོ་ཡིན། །མེ་ཏོག་ལྡན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: His family will be kṣatriya, “And his light will extend thirty million leagues. Ocean will be his father and Endowed with Flowers his mother.

source: སྲས་པོ་ཚོགས་དགའ་ནི་ཁུམ་རིམ་གྲོ་པ། །
en: Joyous Accumulation will be his son and Bent his attendant.

source: སེང་གེས་བལྟས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Lion Sight will be the scholar

source: ཤིན་ཏུ་དགའ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Intense Joy the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུ་སྟེ། །གཉིས་པར་བདུན་ཅུ་གསུམ་པར་སུམ་ཅུ་ཡོད། །
en: Eight hundred billion worthy ones will gather. In the second congregation will be seven hundred billion and in the third there will be three hundred billion.

source: མི་དེ་དག་གི་ཚེ་ཡི་ཚད་དག་ནི། །ལོ་གྲངས་སྟོང་ཕྲག་བཞི་བཅུ་རྩ་དྲུག་ཡིན། །
en: The lifespan of humans “Will be forty-six thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ནི་ཚང་བར་གནས། །
en: And the sacred Dharma of the one who has reached exhaustion Will remain complete for ten thousand years.

source: མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་དགུ། །རིན་ཆེན་དག་གིས་རྣམ་པར་སྤྲས་པར་འགྱུར། །
en: There will be nine hundred ninety billion jewel-studded stūpas.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་སྐྱེ་བའི་ཡུལ་ནི་གཙུག་ན་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnaprabha will be born in a place called Jewel Crest.

source: ཡབ་ནི་སྐལ་ལྡན་འདོད་ཅེས་བྱའོ། །
en: Fortunate Wish will be his father.

source: ཡུམ་ནི་གྲགས་ལྷ་ཞེས་བྱའོ། །
en: Divine Fame will be his mother.

source: སྲས་ནི་སྙན་པར་སྨྲ་ཞེས་བྱའོ། །
en: Delightful Speech will be his son.

source: རིམ་གྲོ་པ་ནི་འགྲོ་བ་དགའ་ཞེས་བྱའོ། །
en: Joyous Movement will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་ཅན་གཙོ་བོ་ཞེས་བྱའོ། །
en: Leader of the Gathering will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གདུལ་དཀའ་ཞེས་བྱའོ། །
en: Hard to Tame will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཚོགས་པ་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: In the first congregation will gather nine hundred million hearers;

source: གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་ལྔའོ། །
en: in the second there will be one hundred and twenty million, and in the third there will be one hundred fifty million.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་སྣ་ཚོགས་བརྩེགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ratnaketu will be born in a place called Manifold Pile.

source: ཡབ་ནི་རྒྱ་མཚོའི་བློ་ཞེས་བྱའོ། །
en: Ocean Mind will be his father.

source: ཡུམ་ནི་རྫོགས་སེམས་ཞེས་བྱའོ། །
en: Perfect Mind will be his mother.

source: སྲས་ནི་འཇིག་རྟེན་དགའ་ཞེས་བྱའོ། །
en: Joy for the World will be his son.

source: རིམ་གྲོ་པ་ནི་ང་རོ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Roar will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་དཔལ་ཞེས་བྱའོ། །
en: Splendid Glory will be foremost in terms of miraculous abilities.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་འབུམ་མོ། །
en: The extent of his lifespan will be one trillion years.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །
en: In the first congregation will gather six hundred million hearers;

source: གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: in the second there will be eight hundred;

source: གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: and in the third there will be one billion.

source: མཆོད་རྟེན་ནི་འབུམ་འབྱུང་བར་འགྱུར་རོ། །
en: There will be one hundred thousand stūpas.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་བླ་མ་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Yaśottara will be born in a place called Supreme Flower.

source: སྲས་ནི་གཟི་བརྗིད་མཛེས་པ་ཞེས་བྱའོ། །
en: Splendid Beauty will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་ལྷག་ཅེས་བྱའོ། །
en: Superior Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་པ་ཞེས་བྱའོ། །
en: Truth will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོ་བ་བརྟན་ཞེས་བྱའོ། །
en: Stable Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་མོ། །
en: In the first congregation will gather one billion hearers;

source: གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བཅུའོ། །
en: in the second there will be fifty million, and in the third there will be ten billion.

source: དེ་བཞིན་གཤེགས་པ་འོད་བྱེད་སྐྱེ་བའི་ཡུལ་ནི་རབ་ཏུ་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Prabhākara will be born in a place called Adorned.

source: འོད་ནི་དཔག་ཚད་ཁྲིའོ། །
en: His light will extend ten thousand leagues.

source: ཡབ་ནི་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Crest Banner will be his father.

source: ཡུམ་ནི་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: Stainless Light will be his mother.

source: སྲས་ནི་གློག་སྦྱིན་ཞེས་བྱའོ། །
en: Giver of Lightning will be his son.

source: རིམ་གྲོ་པ་ནི་དགྲ་བཅོམ་དགའ་ཞེས་བྱའོ། །
en: Joyous Worthy One will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་འབྱེད་བློ་ཞེས་བྱའོ། །
en: Discerning Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐུབ་མེད་ཅེས་བྱའོ། །
en: Indomitable will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །
en: In the first congregation will gather seven hundred million hearers;

source: གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: in the second there will be eight hundred million, and in the third there will be nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དཔག་མེད་སྐྱེ་བའི་ཡུལ་ནི་བལྟ་བར་བྱ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Amitatejas will be born in a place called To Be Seen.

source: འོད་ནི་དཔག་ཚད་ས་ཡ་ཕྲག་གཅིག་དང་འབུམ་ཕྲག་གཉིས་སོ། །
en: His light will extend one million two hundred thousand leagues.

source: ཡབ་ནི་བདེ་བར་འདུད་ཅེས་བྱའོ། །
en: Blissful Homage will be his father.

source: ཡུམ་ནི་བཟང་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Gift of Excellence will be his mother.

source: སྲས་ནི་ཚུལ་ཁྲིམས་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Discipline will be his son.

source: རིམ་གྲོ་པ་ནི་མཉམ་པར་སེམས་ཞེས་བྱའོ། །
en: Equanimous Mind will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིགས་བྲལ་ཞེས་བྱའོ། །
en: Free from Fear will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: In the first congregation will gather nine hundred million hearers;

source: གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: in the second there will be nine hundred eighty million,

source: གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དགུའོ། །
en: and in the third there will be nine hundred ninety million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་དུས་མཁྱེན་སྐྱེ་བའི་ཡུལ་ནི་སྐར་མ་དགའ་ཞེས་བྱའོ། །
en: “The thus-gone Velāma will be born in a place called Joyous Star.

source: འོད་ནི་འཛམ་བུའི་གླིང་ཙམ་མོ། །
en: His light will cover Jambudvīpa.

source: ཡུམ་ནི་བློ་གྲོས་བཟང་མོ་ཞེས་བྱའོ། །
en: Excellent Intelligence will be his mother.

source: སྲས་ནི་བཟང་སྦྱིན་ཞེས་བྱའོ། །
en: Gift of Excellence will be his son.

source: རིམ་གྲོ་པ་ནི་དཔག་མེད་འགྲོ་ཞེས་བྱའོ། །
en: Carefree Movement will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཚུངས་མེད་ཅེས་བྱའོ། །
en: Incomparable will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཚོགས་པ་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation will gather eight hundred million hearers;

source: གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་ལྔའོ། །
en: in the second there will be eight hundred fifty million,

source: གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: and in the third there will be nine hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་དྲུག་ཁྲིའོ། །
en: The extent of his lifespan will be sixty thousand years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྐུ་སྐྱེ་བའི་ཡུལ་ནི་ཉམས་དགའ་བ་སྡུག་པ་ཞེས་བྱའོ། །
en: “The thus-gone Siṃhagātra will be born in a place called Lovely Delight.

source: འོད་ནི་གླིང་བཞི་པ་ཙམ་མོ། །
en: His light will cover the four continents.

source: ཡབ་ནི་ལྷའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Divine Flower will be his father.

source: ཡུམ་ནི་མཚུངས་མེད་མཉམ་ཞེས་བྱའོ། །
en: Equaling the Unequaled will be his mother.

source: སྲས་ནི་བློ་ལྡན་ཞེས་བྱའོ། །
en: Intelligent will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསམ་པའི་སྟོབས་ཞེས་བྱའོ། །
en: Strength of Reflection will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་འབྱེད་པའི་སྡེ་ཞེས་བྱའོ། །
en: Force of Discernment will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eighteen successive congregations, each of them gathering one billion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བྱེ་བའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will likewise remain for ten million years.

source: དེ་བཞིན་གཤེགས་པ་མཁས་པའི་བློ་སྐྱེ་བའི་ཡུལ་ནི་མཆོག་བསགས་ཞེས་བྱའོ། །
en: “The thus-gone Vidumati will be born in a place called Supreme Accumulation.

source: ཡབ་ནི་བློ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Mind will be his father.

source: ཡུམ་ནི་ཚངས་མཆོག་ཅེས་བྱའོ། །
en: Brahmā Supreme will be his mother.

source: སྲས་ནི་བརྟུལ་ཞུགས་གྲུབ་ཅེས་བྱའོ། །
en: Accomplishment of Yogic Discipline will be his son.

source: རིམ་གྲོ་པ་ནི་ནོར་ལྷ་ཞེས་བྱའོ། །
en: Wealth God will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་དགའ་ཞེས་བྱའོ། །
en: Joy for the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་བརྟན་པོ་ཞེས་བྱའོ། །
en: Stable Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཅུའོ། །
en: There will be ten successive congregations, each of them gathering one hundred billion.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་བར་དཀའ་སྐྱེ་བའི་ཡུལ་ནི་འོད་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Durjaya will be born in a place called Radiant.

source: འོད་ནི་དཔག་ཚད་ཉི་ཤུའོ། །
en: His light will extend twenty leagues.

source: ཡབ་ནི་མེ་ཏོག་སྦྱིན་ཞེས་བྱའོ། །
en: Flower Gift will be his father.

source: ཡུམ་ནི་མེ་ཏོག་ཕྲེང་ཞེས་བྱའོ། །
en: Flower Garland will be his mother.

source: སྲས་ནི་གཙུག་ན་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Crown Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་མཛོད་འཛིན་ཅེས་བྱའོ། །
en: Holder of the Treasury will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁྱད་པར་འཕགས་ཞེས་བྱའོ། །
en: Distinguished will be foremost in terms of insight.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཁྲིའོ། །
en: In the first congregation will gather ten thousand hearers;

source: གཉིས་པ་ལ་ནི་སུམ་ཁྲིའོ། །གསུམ་པ་ལ་ནི་ལྔ་ཁྲིའོ། །
en: in the second there will be thirty thousand, and in the third there will be fifty thousand.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཕུང་པོ་སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་བལྟ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇaskandha will be born in a place called Constant View.

source: འོད་ནི་དཔག་ཚད་ས་ཡ་ཕྲག་དྲུག་གོ། །
en: His light will extend six million leagues.

source: ཡབ་ནི་མཚོན་ཆ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Weapon will be his father.

source: སྲས་ནི་མྱ་ངན་མེད་ཅེས་བྱའོ། །
en: Free from Suffering will be his son.

source: རིམ་གྲོ་པ་ནི་མྱ་ངན་དང་བྲལ་བ་ཞེས་བྱའོ། །
en: Without Suffering will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལེགས་སེམས་ཞེས་བྱའོ། །
en: Excellent Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་གཡོ་མེད་ཅེས་བྱའོ། །
en: Unswerving Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be eighty successive congregations, each of them gathering eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་བཟང་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Śaśiketu will be born in a place called Supreme Excellence.

source: འོད་ནི་དཔག་ཚད་ས་ཡ་ཕྲག་གཅིག་དང་འབུམ་ཕྲག་བརྒྱད་དོ། །
en: His light will extend one million five hundred thousand leagues.

source: ཡབ་ནི་ལེགས་བཟང་ཞེས་བྱའོ། །
en: Exquisite Excellence will be his father.

source: ཡུམ་ནི་གནམ་མོ་ཞེས་བྱའོ། །
en: Sky Lady will be his mother.

source: སྲས་ནི་སྲོག་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Life Force will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་ལྡན་ཞེས་བྱའོ། །
en: Intelligent will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིག་ལྟ་ཞེས་བྱའོ། །
en: Seeing Eyes will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་བློ་གྲོས་ཞེས་བྱའོ། །
en: Powerful Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་དྲུག་ཅུའོ། །
en: In the first congregation will gather sixty billion hearers;

source: གཉིས་པ་ལ་ནི་ཐེར་འབུམ་བདུན་ཅུའོ། །
en: in the second there will be seventy billion;

source: གསུམ་པ་ལ་ནི་ཐེར་འབུམ་བརྒྱད་ཅུའོ། །
en: in the third, eighty billion;

source: བཞི་པ་ལ་ནི་ཐེར་འབུམ་དགུ་བཅུའོ། །
en: in the fourth, ninety billion;

source: ལྔ་པ་ལ་ནི་ཐེར་འབུམ་བརྒྱའོ། །
en: and in the fifth, one hundred billion.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy-six thousand years.

source: མཆོད་རྟེན་ནི་བརྒྱད་ཁྲི་བཞི་སྟོང་འབྱུང་བར་འགྱུར་རོ། །
en: There will be eighty-four thousand stūpas.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་ཐོབ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Sthāmaprāpta will be born in a place called Infinite Array.

source: འོད་ནི་དཔག་ཚད་སུམ་བརྒྱའོ། །
en: His light will extend three hundred leagues.

source: ཡབ་ནི་སའི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Master of the Land will be his father.

source: ཡུམ་ནི་མིག་བཟངས་མ་ཞེས་བྱའོ། །
en: Excellent Eye will be his mother.

source: སྲས་ནི་ཡེ་ཤེས་དཔལ་ཞེས་བྱའོ། །
en: Glorious Wisdom will be his son.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་འདོད་ཅེས་བྱའོ། །
en: Merit Wish will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་བརྟན་ཞེས་བྱའོ། །
en: Stable Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be thirty successive congregations, each of them gathering one billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-six thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy-one years.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་མཐའ་ཡས་སྐྱེ་བའི་ཡུལ་ནི་ཆོས་ཀྱི་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Anantavikrāmin will be born in a place called Dharma Array.

source: ཡབ་ནི་ཁ་ལོ་སྒྱུར་དགའ་ཞེས་བྱའོ། །
en: Joyous Leader will be his father.

source: ཡུམ་ནི་གྲགས་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Gift of Fame will be his mother.

source: སྲས་ནི་མཚོན་ཆ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Weapon will be his son.

source: རིམ་གྲོ་པ་ནི་གནས་འཕྱག་ཅེས་བྱའོ། །
en: Home Sweeper will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་འབར་བ་ཞེས་བྱའོ། །
en: Blazing Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔལ་འོད་ཅེས་བྱའོ། །
en: Glorious Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དྲུག་འབུམ་མོ། །གཉིས་པ་ལ་ནི་ལྔ་འབུམ་མོ། །གསུམ་པ་ལ་ནི་བཞི་འབུམ་མོ། །
en: In the first congregation will gather six hundred thousand hearers; in the second there will be five hundred thousand, and in the third there will be four hundred thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་འོད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Candra will be born in a place called Adorned with Light.

source: འོད་ནི་དཔག་ཚད་དུང་ཕྱུར་ཕྲག་གསུམ་མོ། །
en: His light will extend three hundred million leagues.

source: ཡབ་ནི་དྲི་མེད་འོད་འཕྲོ་ཞེས་བྱའོ། །
en: Stainless Radiance will be his father.

source: སྲས་ནི་གཟི་བརྗིད་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Splendid Lamp will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་གྱི་ཚོགས་ཞེས་བྱའོ། །
en: Gathering of Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲིབ་པ་མེད་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Unobscured Intelligence will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eighty successive congregations, each of them gathering one billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །
en: His lifespan will be six hundred million years.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Vimala will be born in a place called Great Array.

source: ཡབ་ནི་ཡུལ་འཁོར་བཟང་པོ་ཞེས་བྱའོ། །
en: Land of Excellence will be his father.

source: སྲས་ནི་ནབས་སོ་ཞེས་བྱའོ། །
en: Punarvasu will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་འོས་ཅེས་བྱའོ། །
en: Worthy of Worship will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་དགའ་བ་ཞེས་བྱའོ། །
en: Precious Joy will be foremost in terms of miraculous abilities.

source: གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དགུའོ། །
en: in the second there will be nine hundred ninety million,

source: གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: and in the third there will be eight hundred eighty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་དོན་ཐམས་ཅད་གཟིགས་པ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཕུང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Sarvārtha­darśin will be born in a place called Splendid Hill.

source: འོད་ནི་དཔག་ཚད་བྱེ་བ་ཕྲག་གཉིས་དང་ས་ཡ་ཕྲག་ལྔའོ། །
en: His light will extend twenty-five million leagues.

source: ཡབ་ནི་རྡོ་རྗེའི་སྡེ་ཞེས་བྱའོ། །
en: Vajra Force will be his father.

source: ཡུམ་ནི་རྒྱ་མཚོས་བྱིན་ཞེས་བྱའོ། །
en: Ocean Gift will be his mother.

source: སྲས་ནི་དགའ་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Joyous Melody will be his son.

source: རིམ་གྲོ་པ་ནི་དོན་དགའ་ཞེས་བྱའོ། །
en: Meaningful Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒོལ་བ་ཚར་གཅོད་ཅེས་བྱའོ། །
en: Defeater of Attacks will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པའི་མངོན་པར་འཕགས་ཞེས་བྱའོ། །
en: Superior Fame will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་སྟེ་ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be twenty successive congregations, each of them gathering one hundred thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་དཔའ་བོ་སྐྱེ་བའི་ཡུལ་ནི་ཚུགས་པ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Śūra will be born in a place called Impenetrable.

source: ཡབ་ནི་དགའ་བའི་འོད་ཅེས་བྱའོ། །
en: Light of Joy will be his father.

source: རིམ་གྲོ་པ་ནི་དབྱངས་སྙན་ཞེས་བྱའོ། །
en: Beautiful Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་སེམས་པ་ཞེས་བྱའོ། །
en: Delightful Attention will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོག་སྨྲ་ཞེས་བྱའོ། །
en: Supreme Speech will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be sixty successive congregations, each of them gathering one hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་འབྱོར་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་བསམས་བཞིན་སྟེར་ཞེས་བྱའོ། །
en: “The thus-gone Samṛddha will be born in a place called Yielding as Wished.

source: འོད་ནི་དཔག་ཚད་བཞི་ཁྲིའོ། །
en: His light will extend four thousand leagues.

source: ཡུམ་ནི་ངེས་པར་དགའ་ཞེས་བྱའོ། །
en: Thoroughly Joyous will be his mother.

source: སྲས་ནི་དོན་སེམས་ཞེས་བྱའོ། །
en: True Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་སེམས་ཞེས་བྱའོ། །
en: Dharma Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་ཅན་ཞེས་བྱའོ། །
en: Endowed with Dharma will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་ཏོག་ཅེས་བྱའོ། །
en: Moon Crest will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be forty successive congregations, each of them gathering ten billion.

source: དམ་པའི་ཆོས་ནི་ལོ་ཐེར་འབུམ་ཕྲག་བཞི་བཅུའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for forty billion years.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྐྱེ་བའི་ཡུལ་ནི་སྐྱེ་བོས་མཆོད་ཅེས་བྱའོ། །
en: “The thus-gone Puṇya will be born in a place called The People’s Offering.

source: འོད་ནི་དཔག་ཚད་དགུ་ཁྲི་དགུ་སྟོང་ངོ་། །
en: His light will extend ninety-four thousand leagues.

source: ཡུམ་ནི་སྙན་པར་དགའ་ཞེས་བྱའོ། །
en: Delightful to Hear will be his mother.

source: སྲས་ནི་དགའ་བོ་ཞེས་བྱའོ། །
en: Joyous will be his son.

source: རིམ་གྲོ་པ་ནི་སྐྱེ་བོ་ཕལ་ཆེན་དགའ་ཞེས་བྱའོ། །
en: Vast Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ལག་ཅེས་བྱའོ། །
en: Wisdom Hand will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་སྟོབས་ཞེས་བྱའོ། །
en: Dharma Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུའོ། །
en: In the first congregation will gather seven hundred million hearers;

source: གཉིས་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་ལྔའོ། །
en: in the second there will be six hundred fifty million;

source: གསུམ་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་དྲུག་ཅུའོ། །
en: and in the third there will be six hundred million.

source: དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱའོ། །
en: The thus-gone Pradīpa will be born in a place called Jewel Treasury.

source: འོད་ནི་དཔག་ཚད་དགུ་སྟོང་བརྒྱད་བརྒྱའོ། །
en: His light will extend nine thousand eight hundred leagues.

source: ཡབ་ནི་ཙན་དན་ཅེས་བྱའོ། །
en: Sandalwood will be his father.

source: ཡུམ་ནི་སྤོབས་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Acumen will be his mother.

source: རིམ་གྲོ་པ་ནི་སྦྲང་རྩི་སྦྱིན་ཞེས་བྱའོ། །
en: Honey Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚིག་སྙན་ཅེས་བྱའོ། །
en: Delightful Words will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེམས་གསལ་ཞེས་བྱའོ། །
en: Clear Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be forty successive congregations, each of them gathering seven hundred seventy million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་སྟོང་ངོ་། །
en: The extent of his lifespan will be nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འོད་འཕྲོ་སྐྱེ་བའི་ཡུལ་ནི་དོན་སྣང་ཞེས་བྱའོ། །
en: “The thus-gone Guṇārci will be born in a place called Meaningful Light.

source: ཡབ་ནི་བདེ་བར་གཞོལ་ཞེས་བྱའོ། །
en: Joyous Endeavor will be his father.

source: སྲས་ནི་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་འབྱོར་ལྡན་ཞེས་བྱའོ། །
en: Wealthy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Wisdom will be foremost in terms of insight.
